{
  "tasks": [
    {
      "id": "enhance_001",
      "title": "Add AI mood analysis service with OpenAI integration",
      "description": "Replace the hardcoded keyword-matching mood analysis in backend/internal/services/vibe_service.go with a real AI-powered analysis using OpenAI GPT-4o-mini. This is the CORE feature of the app and currently has ZERO AI integration.\n\nFiles to modify:\n1. backend/internal/config/config.go — Add OPENAI_API_KEY env var to Config struct and LoadConfig(). Add field `OpenAIAPIKey string` and load with `getEnv(\"OPENAI_API_KEY\", \"\")`.\n2. backend/internal/services/vibe_service.go — Complete rewrite of analyzeMood() and calculateVibeScore():\n   - Add a new struct `openAIRequest` with model, messages, temperature, max_tokens, response_format fields.\n   - Add `openAIResponse` struct to parse the API response.\n   - Replace analyzeMood() to call POST https://api.openai.com/v1/chat/completions with model \"gpt-4o-mini\", system prompt: \"You are a mood-to-aesthetic analyzer. Given a user's mood text, analyze it and return a JSON object with: aesthetic (one of: chill, energetic, romantic, melancholy, adventurous, creative, peaceful, confident, cozy, mysterious), emoji (single emoji that matches the mood), vibe_score (integer 10-100 where 100 is most positive), reasoning (one sentence explaining the match). Be creative and insightful.\", user message is the mood_text. Parse the JSON response to extract aesthetic, emoji, vibe_score.\n   - Use the existing Aesthetics map in models/vibe.go to get the 3-color palette for the matched aesthetic.\n   - Keep the keyword-based analyzeMood as fallbackAnalyzeMood() — if the API call fails (timeout, rate limit, error), fall back to keyword matching so the app never breaks.\n   - Add http.Client with 10-second timeout for the API call.\n   - calculateVibeScore() should now use the AI-returned vibe_score instead of the keyword counter.\n3. backend/cmd/server/main.go — Pass cfg.OpenAIAPIKey to NewVibeService(db, apiKey).\n4. .env.example — Add OPENAI_API_KEY=sk-your-openai-api-key-here.\n\nThe VibeService struct gains an apiKey field. If apiKey is empty, always use fallback. This ensures backward compatibility.",
      "status": "pending",
      "priority": 10,
      "depends_on": [],
      "test_command": "cd backend && go build ./...",
      "auto_commit": true,
      "created_at": "",
      "updated_at": "2026-02-07T14:34:31Z",
      "error": "planning failed: engine: all 1 providers failed:\n  provider GLM-Planner (glm-4.7): failed after 2 retries: API returned 429: {\"error\":{\"code\":\"1302\",\"message\":\"Rate limit reached for requests\"}}"
    },
    {
      "id": "enhance_002",
      "title": "Add admin role middleware and fix security vulnerabilities",
      "description": "Fix critical security issues: admin endpoints accessible to ALL authenticated users, and Apple Sign-In token not verified.\n\nFiles to modify:\n1. backend/internal/models/user.go — Add `Role string` field: `Role string \\`gorm:\"type:varchar(20);default:'user'\\\"\\`` with values 'user' and 'admin'.\n2. backend/internal/middleware/auth.go — Add new function `AdminRequired()` fiber.Handler that extracts JWT claims, gets user from DB by sub claim, checks user.Role == \"admin\". Return 403 {\"error\": true, \"message\": \"admin access required\"} if not admin.\n3. backend/internal/routes/routes.go — Wrap admin group routes with the new AdminRequired middleware: `admin := api.Group(\"/admin\", middleware.Protected(cfg.JWTSecret), middleware.AdminRequired(db))`.\n4. backend/internal/services/auth_service.go — Fix AppleSignIn: add proper Apple JWKS verification. Add function fetchApplePublicKeys() that GETs https://appleid.apple.com/auth/keys and parses the JWKS JSON. Add verifyAppleToken(identityToken string) that decodes the JWT header to get 'kid', finds matching key in JWKS, constructs RSA public key, and verifies the token signature using jwt.Parse with the RSA key. Also verify iss==\"https://appleid.apple.com\" and aud matches your bundle ID. Add APPLE_BUNDLE_ID to config.\n5. backend/internal/config/config.go — Add `AppleBundleID string` field loaded from APPLE_BUNDLE_ID env var.\n6. backend/internal/dto/auth_dto.go — Add Role field to UserResponse: `Role string \\`json:\"role\\\"\\``.\n\nThis fixes two App Store review blockers and one critical security vulnerability.",
      "status": "pending",
      "priority": 10,
      "depends_on": [],
      "test_command": "cd backend && go build ./...",
      "auto_commit": true,
      "created_at": "",
      "updated_at": "2026-02-07T14:34:34Z",
      "error": "planning failed: engine: all 1 providers failed:\n  provider GLM-Planner (glm-4.7): failed after 2 retries: API returned 429: {\"error\":{\"code\":\"1302\",\"message\":\"Rate limit reached for requests\"}}"
    },
    {
      "id": "enhance_003",
      "title": "Add guest mode with 3 free uses and usage tracking",
      "description": "Implement guest mode allowing 3 free vibe checks without login, tracked via AsyncStorage on mobile and an anonymous endpoint on backend.\n\nFiles to modify:\n1. backend/internal/handlers/vibe_handler.go — Add new handler CreateGuestVibeCheck that does NOT require auth. Accepts mood_text + device_id (string). Queries VibeCheck where user_id IS NULL and device_id matches, counts today's checks. If count >= 3, return 403 {\"error\": true, \"message\": \"Free limit reached. Sign up for unlimited vibes!\"}. Otherwise creates VibeCheck with nil UserID and device_id.\n2. backend/internal/models/vibe.go — Add `DeviceID *string \\`gorm:\"type:varchar(100);index\\\"\\`` to VibeCheck model (nullable, for guest checks). Make UserID nullable: change to `*uuid.UUID`.\n3. backend/internal/routes/routes.go — Add public route: `api.Post(\"/vibes/guest\", vibeHandler.CreateGuestVibeCheck)`.\n4. backend/internal/services/vibe_service.go — Add CreateGuestVibeCheck(moodText, deviceID string) method that calls analyzeMood and saves with nil UserID.\n5. mobile/lib/storage.ts — Add functions: getDeviceID() that generates a UUID on first call and stores in SecureStore as 'device_id', getGuestUsageCount()/incrementGuestUsage()/resetGuestUsage() using AsyncStorage with key 'guest_vibe_count' and 'guest_vibe_date' (reset daily).\n6. mobile/app/index.tsx — Update routing logic: check onboarding_completed in AsyncStorage first, then check guest mode (hasRemainingFreeUses), then auth state. Route to onboarding if first launch, to /(protected)/home if guest with uses remaining, to /(auth)/login otherwise.\n7. mobile/contexts/AuthContext.tsx — Add `isGuest: boolean` state. Add `continueAsGuest()` function that sets isGuest=true and navigates to protected home. Export isGuest in context value.\n\nGuest users see a banner on home screen showing remaining free uses (e.g., '2 free vibes remaining') with a 'Sign Up' CTA button.",
      "status": "pending",
      "priority": 9,
      "depends_on": [
        "enhance_001"
      ],
      "test_command": "cd backend && go build ./...",
      "auto_commit": true,
      "created_at": "",
      "updated_at": ""
    },
    {
      "id": "enhance_004",
      "title": "Build 3-screen onboarding flow",
      "description": "Create a beautiful 3-screen onboarding experience that introduces VibeCheck to new users.\n\nFiles to create:\n1. mobile/app/onboarding.tsx — Full onboarding screen with 3 pages using ScrollView with pagingEnabled and horizontal. Track currentPage with state.\n\nPage 1 (Welcome): Large emoji '✨' (text-7xl), title 'Welcome to VibeCheck' (text-3xl font-bold text-gray-900), subtitle 'Turn your mood into a visual aesthetic' (text-lg text-gray-500 mt-3), gradient-inspired background using View with bg-primary-50 and rounded-3xl card.\n\nPage 2 (Features): Title 'How It Works' (text-2xl font-bold), 3 feature rows each with icon circle (bg-primary-100 w-14 h-14 rounded-full items-center justify-center) + text: '📝 Describe your mood' / '🎨 Get a unique aesthetic' / '🔥 Build your vibe streak'. Each row uses flex-row items-center gap-4 with title (text-base font-semibold) and description (text-sm text-gray-500).\n\nPage 3 (CTA): Title 'Ready to Vibe?' (text-3xl font-bold), two buttons: primary 'Try Free — 3 Vibes' (bg-primary-600 rounded-2xl py-4) calls continueAsGuest(), and secondary 'Sign In' (border border-gray-300 rounded-2xl py-4) navigates to /(auth)/login.\n\nDot indicators at bottom: 3 circles (w-2 h-2 rounded-full), active=bg-primary-600, inactive=bg-gray-300.\n\nOn completing onboarding, save 'onboarding_completed' = 'true' to AsyncStorage.\n\nFiles to modify:\n2. mobile/app/index.tsx — Add AsyncStorage check: if onboarding_completed !== 'true', redirect to /onboarding. Import AsyncStorage from @react-native-async-storage if available, or use expo-secure-store.\n3. mobile/app/(auth)/login.tsx — Add 'Skip for now' text button (text-primary-600 text-sm font-medium) below the sign-in button that calls continueAsGuest() from AuthContext.\n\nUse hapticLight on page scroll, hapticSuccess on CTA press.",
      "status": "pending",
      "priority": 8,
      "depends_on": [
        "enhance_003"
      ],
      "test_command": "cd mobile && npx tsc --noEmit",
      "auto_commit": true,
      "created_at": "",
      "updated_at": ""
    },
    {
      "id": "enhance_005",
      "title": "Redesign home screen with premium vibe card and animations",
      "description": "Completely redesign mobile/app/(protected)/home.tsx for App Store quality with gradients, shadows, and polished UI.\n\nFile to modify: mobile/app/(protected)/home.tsx\n\nComplete rewrite of the screen:\n\n1. HEADER SECTION: Replace plain text with styled header. 'VibeCheck' title (text-2xl font-bold text-gray-900) + subtitle showing streak with fire emoji: '🔥 {stats.current_streak} day streak' (text-sm text-primary-600 font-medium). Right side: share icon button if today's vibe exists.\n\n2. VIBE CARD (when today's vibe exists): Full-width card (rounded-3xl overflow-hidden) with background color from color_primary at 15% opacity. Inner padding p-6. Top: large emoji (text-6xl) centered. Below: aesthetic name (text-2xl font-bold text-gray-900 text-center mt-3). Vibe score displayed as circular progress: outer View (w-20 h-20 rounded-full border-4 items-center justify-center) with border color from color_primary, inner text showing score number (text-xl font-bold). Mood text in italic (text-base text-gray-600 italic text-center mt-4) wrapped in quotes. Three color circles in a row showing the aesthetic palette (w-8 h-8 rounded-full) with color_primary, color_secondary, color_accent as backgroundColor.\n\n3. INPUT SECTION (when no vibe today): Card with bg-white rounded-3xl p-6 shadow-lg. Title \"How are you feeling?\" (text-xl font-semibold text-gray-900). TextInput with multiline, 4 numberOfLines, placeholder \"Describe your mood, thoughts, or how your day is going...\" (bg-gray-50 rounded-2xl p-4 text-base text-gray-800 min-h-[120px]). Character counter (text-xs text-gray-400 text-right mt-1) showing {length}/500. Submit button: full-width bg-primary-600 rounded-2xl py-4, text 'Check My Vibe ✨' (text-white text-lg font-semibold text-center). Loading state with ActivityIndicator.\n\n4. STATS ROW: 3 cards in flex-row gap-3. Each card: bg-white rounded-2xl p-4 flex-1 items-center shadow-sm. Value (text-2xl font-bold text-gray-900), label (text-xs text-gray-500 mt-1). Stats: 🔥 streak, 📊 total vibes, ⭐ avg score.\n\n5. GUEST BANNER (if isGuest from AuthContext): View with bg-amber-50 border border-amber-200 rounded-2xl p-4 mx-5 mt-3. Text 'You have {remaining} free vibes left' (text-amber-800 font-medium). 'Sign Up for Unlimited' button (text-primary-600 font-semibold mt-2) linking to register.\n\n6. Remove the horizontal aesthetic gallery (it's filler content). Add hapticSuccess on successful vibe check, hapticError on failure.",
      "status": "pending",
      "priority": 8,
      "depends_on": [
        "enhance_003"
      ],
      "test_command": "cd mobile && npx tsc --noEmit",
      "auto_commit": true,
      "created_at": "",
      "updated_at": ""
    },
    {
      "id": "enhance_006",
      "title": "Redesign history screen with polished vibe cards",
      "description": "Redesign mobile/app/(protected)/history.tsx for App Store quality with proper card design, better empty state, and pull-to-refresh.\n\nFile to modify: mobile/app/(protected)/history.tsx\n\nComplete rewrite:\n\n1. HEADER: Fixed top section with title 'Vibe History' (text-2xl font-bold text-gray-900 px-5 pt-4 pb-2) and subtitle showing total count (text-sm text-gray-500).\n\n2. VIBE HISTORY CARDS: Each FlatList item is a Pressable card (bg-white rounded-2xl p-4 mx-5 mb-3 shadow-sm). Layout: Left side has a colored circle (w-12 h-12 rounded-full items-center justify-center) with backgroundColor from item.color_primary at 20% opacity, containing the emoji (text-2xl). Right side (flex-1 ml-4): top row has aesthetic name (text-base font-semibold text-gray-900) and vibe score badge (bg-primary-50 rounded-full px-2.5 py-0.5, text-xs font-bold text-primary-700). Second row: mood text truncated to 2 lines (text-sm text-gray-500 mt-1 numberOfLines={2}). Third row: date formatted as 'Mon DD, YYYY' (text-xs text-gray-400 mt-2). Three small color dots (w-3 h-3 rounded-full) in a row showing the aesthetic palette.\n\n3. EMPTY STATE: Centered view with large emoji '🎭' (text-6xl), title 'No Vibes Yet' (text-xl font-semibold text-gray-900 mt-4), subtitle 'Check your first vibe to start building your history' (text-base text-gray-500 mt-2 text-center px-8), and CTA button 'Check My Vibe' (bg-primary-600 rounded-2xl px-8 py-3 mt-6) that navigates to home tab.\n\n4. LOADING STATE: Full-screen centered ActivityIndicator with color primary-600 and 'Loading your vibes...' text below.\n\n5. Pull-to-refresh using RefreshControl with tintColor primary-600. FlatList with contentContainerStyle for proper padding. ItemSeparatorComponent not needed (mb-3 on cards handles spacing).\n\n6. On card press: expand the card to show full mood text + share button. Use a local expandedId state. When expanded, show full mood text (no numberOfLines), a divider (h-px bg-gray-100 my-3), and a share button row with 'Share This Vibe' (text-primary-600 font-medium) calling Share.share.\n\nAdd hapticSelection on card press, hapticLight on scroll.",
      "status": "pending",
      "priority": 7,
      "depends_on": [],
      "test_command": "cd mobile && npx tsc --noEmit",
      "auto_commit": true,
      "created_at": "",
      "updated_at": "2026-02-07T14:34:37Z",
      "error": "planning failed: engine: all 1 providers failed:\n  provider GLM-Planner (glm-4.7): failed after 2 retries: API returned 429: {\"error\":{\"code\":\"1302\",\"message\":\"Rate limit reached for requests\"}}"
    },
    {
      "id": "enhance_007",
      "title": "Fix settings screen: real restore purchases, privacy policy, biometric persistence",
      "description": "Fix all stub/placeholder issues in mobile/app/(protected)/settings.tsx and add required App Store compliance items.\n\nFile to modify: mobile/app/(protected)/settings.tsx\n\nChanges:\n\n1. FIX RESTORE PURCHASES STUB (lines 62-67): Replace the Alert-only stub with real RevenueCat restore. Import `useSubscription` from contexts/SubscriptionContext. Call `handleRestore()` from the subscription context. Add loading state during restore. Show success alert 'Purchases restored successfully' with hapticSuccess, or error alert with hapticError.\n\n2. PERSIST BIOMETRIC SETTING: Use expo-secure-store to persist biometric_enabled flag. On mount, read the stored value. On toggle, save to SecureStore. This is currently local state only and resets on every app launch.\n\n3. ADD PRIVACY POLICY SECTION: New section 'Legal' with two Pressable rows: 'Privacy Policy' and 'Terms of Service' that open URLs via Linking.openURL(). Use Ionicons chevron-forward icon on the right. URLs should come from a config constant (e.g., PRIVACY_POLICY_URL, TERMS_URL) — for now set to placeholder URLs that the developer will replace.\n\n4. ADD APP VERSION: At the bottom of the scroll view, show app version from expo-constants: Constants.expoConfig?.version (text-xs text-gray-400 text-center py-4).\n\n5. REDESIGN LAYOUT: Group settings into sections with headers. Section 'Account' (email, sign out), Section 'Security' (biometrics toggle), Section 'Subscription' (restore purchases, subscription status showing isSubscribed ? 'Premium' : 'Free'), Section 'Legal' (privacy, terms), Section 'Danger Zone' (delete account in red). Each section has a header (text-xs font-semibold text-gray-500 uppercase tracking-wider px-5 py-2 mt-4) and white card container (bg-white rounded-2xl mx-5 overflow-hidden). Rows are Pressable with px-5 py-4 flex-row items-center justify-between, separated by h-px bg-gray-100 dividers.\n\n6. Add hapticSelection on every row press.",
      "status": "pending",
      "priority": 7,
      "depends_on": [],
      "test_command": "cd mobile && npx tsc --noEmit",
      "auto_commit": true,
      "created_at": "",
      "updated_at": "2026-02-07T14:34:40Z",
      "error": "planning failed: engine: all 1 providers failed:\n  provider GLM-Planner (glm-4.7): failed after 2 retries: API returned 429: {\"error\":{\"code\":\"1302\",\"message\":\"Rate limit reached for requests\"}}"
    },
    {
      "id": "enhance_008",
      "title": "Build shareable vibe result card component",
      "description": "Create a beautiful shareable vibe card that users can share to social media after each vibe check.\n\nFiles to create:\n1. mobile/components/ui/VibeCard.tsx — A presentational component that renders a shareable vibe result card.\n\nProps: { aesthetic: string, emoji: string, vibeScore: number, moodText: string, colorPrimary: string, colorSecondary: string, colorAccent: string, date: string, streak?: number }\n\nJSX structure:\nOuter View (w-full rounded-3xl overflow-hidden) with dynamic backgroundColor={colorPrimary + '15'} (15% opacity hex).\nInner padding p-6:\n- Top bar: 'VibeCheck' brand text (text-xs font-bold text-gray-400 uppercase tracking-widest) + date (text-xs text-gray-400) in flex-row justify-between.\n- Center: Large emoji (text-7xl text-center mt-6). Aesthetic name below (text-2xl font-bold text-gray-900 text-center mt-3 capitalize).\n- Vibe score: Circular badge (w-16 h-16 rounded-full border-[3px] items-center justify-center self-center mt-4) with borderColor={colorPrimary}. Score number inside (text-xl font-bold) with color={colorPrimary}. Label 'vibe score' below (text-xs text-gray-500 text-center mt-1).\n- Mood quote: View with borderLeftWidth 3, borderLeftColor={colorPrimary}, pl-4 mt-5. Mood text inside (text-base text-gray-600 italic). Max 3 lines with numberOfLines={3}.\n- Color palette: flex-row gap-2 mt-5 justify-center. Three circles (w-6 h-6 rounded-full) with the 3 aesthetic colors.\n- Streak badge (if streak > 0): flex-row items-center self-center mt-4 bg-amber-50 rounded-full px-4 py-1.5. Fire emoji + '{streak} day streak' (text-sm font-semibold text-amber-700).\n- Footer: 'vibecheck.app' (text-xs text-gray-300 text-center mt-4).\n\nFiles to modify:\n2. mobile/app/(protected)/home.tsx — After a successful vibe check, show the VibeCard component with a 'Share Your Vibe' button below it. The share button (bg-gray-900 rounded-2xl py-4 mt-4) calls Share.share() with message: '{emoji} My vibe today is {aesthetic}! Score: {vibeScore}/100\\n\\nCheck your vibe at vibecheck.app'. Add hapticSuccess after share.\n\nThe VibeCard is reused on the history screen when a card is expanded (pass the vibe data as props).",
      "status": "pending",
      "priority": 7,
      "depends_on": [
        "enhance_005"
      ],
      "test_command": "cd mobile && npx tsc --noEmit",
      "auto_commit": true,
      "created_at": "",
      "updated_at": ""
    },
    {
      "id": "enhance_009",
      "title": "Implement daily streak system with persistent tracking",
      "description": "The backend already has streak tracking in vibe_service.go (updateStreak), but the mobile app needs to properly display and celebrate streaks. Fix the streak display and add streak celebration UI.\n\nFiles to modify:\n1. backend/internal/services/vibe_service.go — Fix the aestheticKeys array in the fallback random selection (line 85). Currently missing 'melancholy' and 'peaceful' from the list of 10 aesthetics. The array should be: []string{\"chill\", \"energetic\", \"romantic\", \"melancholy\", \"adventurous\", \"creative\", \"peaceful\", \"confident\", \"cozy\", \"mysterious\"}. This is a bug — only 8 of 10 aesthetics can be randomly selected.\n\n2. mobile/app/(protected)/home.tsx — Add streak celebration when the user completes a vibe check and their streak increases. After a successful CreateVibeCheck API call, compare new streak with previous. If streak increased, show a celebration overlay: a centered View with large fire emoji (text-7xl), streak count (text-4xl font-bold text-amber-500), and message based on milestones:\n   - streak == 3: '🥉 Bronze Streak! 3 days!' \n   - streak == 7: '🥈 Silver Streak! 1 week!'\n   - streak == 14: '🥇 Gold Streak! 2 weeks!'\n   - streak == 30: '💎 Diamond Streak! 1 month!'\n   - default: '🔥 {streak} Day Streak!'\n   The overlay auto-dismisses after 2.5 seconds (setTimeout). Use hapticSuccess for milestones, hapticLight otherwise.\n\n3. mobile/app/(protected)/home.tsx — In the stats row, make the streak card highlight when streak > 0: change bg-white to bg-amber-50 and add border border-amber-200. Show the streak fire emoji animating (use a simple opacity pulse with setInterval toggling opacity between 0.7 and 1.0 every 500ms via state).\n\n4. Ensure GetVibeStats endpoint returns correct streak data — verify the COALESCE query in vibe_service.go handles the case where no VibeStreak record exists yet (it does, using LEFT JOIN and COALESCE, confirmed in the code).",
      "status": "pending",
      "priority": 6,
      "depends_on": [
        "enhance_005"
      ],
      "test_command": "cd backend && go build ./...",
      "auto_commit": true,
      "created_at": "",
      "updated_at": ""
    },
    {
      "id": "enhance_010",
      "title": "Implement subscription gating with free tier limits",
      "description": "The app has a paywall screen and RevenueCat integration but NEVER checks isSubscribed to gate any feature. Implement proper free vs premium tier gating.\n\nFiles to modify:\n1. backend/internal/services/vibe_service.go — Add subscription-aware limits. In CreateVibeCheck, after the one-per-day check, add a premium feature: free users get the keyword-based fallback analysis, premium users get AI-powered analysis (GPT-4o-mini). Add a `isPremium` parameter to CreateVibeCheck. If isPremium is false AND the OpenAI API key is set, still use the AI but with a simpler prompt. If isPremium is true, use the full detailed prompt with richer analysis.\n\n2. backend/internal/handlers/vibe_handler.go — In CreateVibeCheck handler, check user's subscription status from the database. Query the Subscription model where user_id matches and status = 'active' and current_period_end > now(). Pass isPremium boolean to the service.\n\n3. mobile/app/(protected)/home.tsx — Import useSubscription from SubscriptionContext. If !isSubscribed, show a subtle 'Upgrade to Premium' banner below the stats row: View bg-primary-50 rounded-2xl p-4 mx-5 mt-3, with text 'Unlock deeper AI insights with Premium' (text-sm text-gray-700) and 'Upgrade' button (text-primary-600 font-semibold) that navigates to paywall.\n\n4. mobile/app/(protected)/paywall.tsx — Replace generic feature descriptions with VibeCheck-specific ones: '🧠 AI-Powered Deep Mood Analysis' (vs basic keyword matching), '🎨 20+ Aesthetic Palettes' (future expansion), '📊 Advanced Vibe Analytics', '🔮 Personalized Mood Insights'. Style each feature row with bg-white rounded-2xl p-4 mb-2 flex-row items-center gap-3, icon in a w-10 h-10 rounded-xl bg-primary-50 centered, text as text-base font-medium text-gray-900. Add price display for each package: monthly and yearly with savings percentage badge.\n\n5. mobile/app/(protected)/paywall.tsx — Fix the overall layout: Add a large header emoji '👑' (text-6xl text-center), title 'Go Premium' (text-3xl font-bold text-gray-900 text-center mt-3), subtitle 'Unlock the full VibeCheck experience' (text-base text-gray-500 text-center mt-1). At bottom, restore purchases link and terms text.",
      "status": "pending",
      "priority": 6,
      "depends_on": [
        "enhance_001",
        "enhance_005"
      ],
      "test_command": "cd backend && go build ./...",
      "auto_commit": true,
      "created_at": "",
      "updated_at": ""
    },
    {
      "id": "enhance_011",
      "title": "Build custom tab bar with Slot pattern for NativeWind v4",
      "description": "Replace the default expo-router Tabs navigator with a custom tab bar using the Slot pattern for full NativeWind v4 compatibility and visual polish.\n\nFile to modify: mobile/app/(protected)/_layout.tsx\n\nComplete rewrite:\n\nReplace the <Tabs> component with a custom implementation using Slot from expo-router. The layout should have:\n\n1. Import { Slot, usePathname, useRouter } from 'expo-router' and Ionicons, Pressable, View, Text, Platform from react-native.\n\n2. Auth guard stays the same — redirect to login if not authenticated.\n\n3. Main layout: View className='flex-1 bg-gray-50'. Slot renders the active screen content. Custom tab bar at the bottom.\n\n4. Custom TabBar component: View className='flex-row bg-white border-t border-gray-100 pb-{Platform.OS === \"ios\" ? 8 : 4} pt-2 px-4'. Use useSafeAreaInsets().bottom for proper iPhone bottom spacing.\n\n5. Three tab items defined in array: [{route: '/(protected)/home', icon: 'sparkles', label: 'Vibe'}, {route: '/(protected)/history', icon: 'time', label: 'History'}, {route: '/(protected)/settings', icon: 'settings-sharp', label: 'Settings'}].\n\n6. Each tab is a Pressable (flex-1 items-center py-1). Active state detected via usePathname(). Active: icon color primary-600 (#2563eb), label text-primary-600 font-semibold. Inactive: icon color gray-400 (#9ca3af), label text-gray-400. Icon size 22. Label text-xs mt-0.5.\n\n7. Active indicator: small dot (w-1 h-1 rounded-full bg-primary-600 mt-1) below the active tab label.\n\n8. Haptic feedback: call hapticSelection() from lib/haptics on every tab press.\n\n9. The paywall route is NOT in the tab bar — it's navigated to programmatically via router.push('/(protected)/paywall').\n\nThis approach gives full control over styling, avoids expo-router Tabs theming limitations with NativeWind v4, and provides a cleaner visual design.",
      "status": "pending",
      "priority": 6,
      "depends_on": [],
      "test_command": "cd mobile && npx tsc --noEmit",
      "auto_commit": true,
      "created_at": "",
      "updated_at": "2026-02-07T14:34:44Z",
      "error": "planning failed: engine: all 1 providers failed:\n  provider GLM-Planner (glm-4.7): failed after 2 retries: API returned 429: {\"error\":{\"code\":\"1302\",\"message\":\"Rate limit reached for requests\"}}"
    },
    {
      "id": "enhance_012",
      "title": "Fix register screen auto-login and improve auth flow UX",
      "description": "Fix the register screen to auto-login after successful registration (currently it does via AuthContext.register which saves tokens, but the UX text and flow need polish). Also fix placeholder/template text across auth screens.\n\nFiles to modify:\n1. mobile/app/(auth)/register.tsx — Replace generic subtitle 'Start building something great' (line 56) with 'Discover your daily vibe aesthetic'. After successful registration, the AuthContext.register already saves tokens and sets user state, which triggers the index.tsx redirect to protected/home. Add a brief success haptic and ensure the loading state shows 'Creating your account...' text below the ActivityIndicator. Add 'By creating an account, you agree to our Terms of Service and Privacy Policy' text at the bottom (text-xs text-gray-400 text-center) with Linking.openURL taps on the linked phrases.\n\n2. mobile/app/(auth)/login.tsx — Improve layout: Add app branding at top — emoji '✨' (text-5xl text-center), 'VibeCheck' (text-3xl font-bold text-gray-900 text-center mt-2), 'Welcome back' (text-base text-gray-500 text-center mt-1). Move the 'Don't have an account? Sign Up' link higher (above Apple Sign In). Add 'Skip for now' text button below everything: Pressable with text 'Skip for now' (text-sm text-gray-400 text-center mt-4) that calls continueAsGuest() from AuthContext. Add hapticLight on skip press.\n\n3. mobile/app/(auth)/_layout.tsx — Keep headerless Stack but add bg-white to screenOptions for consistent background.\n\n4. mobile/contexts/AuthContext.tsx — Ensure register() method calls hapticSuccess() after successful registration. Add continueAsGuest export (sets isGuest state, navigates to home). Ensure loginWithApple calls hapticSuccess on success.\n\nAll auth screens should have consistent padding (px-6), consistent spacing, and primary-600 accent colors.",
      "status": "pending",
      "priority": 7,
      "depends_on": [
        "enhance_003"
      ],
      "test_command": "cd mobile && npx tsc --noEmit",
      "auto_commit": true,
      "created_at": "",
      "updated_at": ""
    },
    {
      "id": "enhance_013",
      "title": "Add comprehensive loading, error, and empty states across all screens",
      "description": "Every screen needs proper loading, error, and empty states for App Store quality. Currently most screens have minimal or no error handling UI.\n\nFiles to modify:\n1. mobile/app/(protected)/home.tsx — LOADING: When fetching today's vibe or stats on mount, show a full-screen skeleton loader: 3 rounded-3xl Views with bg-gray-100 and animated opacity (pulse effect using setInterval toggling 0.3-0.7 opacity). ERROR: If API call fails, show centered View with '😕' emoji (text-5xl), 'Something went wrong' (text-lg font-semibold text-gray-900 mt-3), error message (text-sm text-gray-500 mt-1), and 'Try Again' button (bg-primary-600 rounded-2xl px-8 py-3 mt-4) that retries the fetch. Call hapticError on error.\n\n2. mobile/app/(protected)/history.tsx — LOADING: ActivityIndicator centered with 'Loading your vibes...' text. EMPTY: Already handled but improve with larger emoji and navigation CTA to home. ERROR: Same pattern as home — emoji, message, retry button.\n\n3. mobile/app/(protected)/home.tsx — When submitting a vibe check, show a fun loading state inside the submit button: replace button text with ActivityIndicator + 'Analyzing your vibe...' (text-white text-sm ml-2 flex-row). Disable the button and reduce opacity to 0.7. On success, briefly show '✅ Vibe checked!' before transitioning to the result card.\n\n4. mobile/app/(protected)/settings.tsx — Add loading state for delete account action (show ActivityIndicator in the modal's confirm button). Add loading state for sign out.\n\n5. mobile/app/(auth)/login.tsx and register.tsx — Ensure submit buttons show loading spinners during API calls. Disable all inputs during loading. Show error messages below the form in a red alert box: View bg-red-50 rounded-xl p-3 mt-3, text-sm text-red-700.\n\nAll error states use hapticError(). All success states use hapticSuccess(). All interactive elements have hapticSelection() on press.",
      "status": "pending",
      "priority": 6,
      "depends_on": [
        "enhance_005",
        "enhance_006"
      ],
      "test_command": "cd mobile && npx tsc --noEmit",
      "auto_commit": true,
      "created_at": "",
      "updated_at": ""
    },
    {
      "id": "enhance_014",
      "title": "Add iOS bundle identifier, app metadata, and deployment config",
      "description": "Configure all required iOS metadata and deployment settings for App Store submission.\n\nFiles to modify:\n1. mobile/app.json — Add under 'ios' key: bundleIdentifier: 'com.ahmetcoskunkizilkaya.vibecheck', buildNumber: '1', infoPlist: { NSFaceIDUsageDescription: 'VibeCheck uses Face ID to protect your account', NSCameraUsageDescription: 'VibeCheck needs camera access for future features' }, supportsTablet: false, config: { usesNonExemptEncryption: false }. Add under 'android' key: package: 'com.ahmetcoskunkizilkaya.vibecheck', adaptiveIcon with foregroundImage and backgroundColor. Set userInterfaceStyle to 'light'. Add 'owner': 'ahmetcoskunkizilkaya'.\n\n2. mobile/app.json — Add expo.plugins array if not present: ['expo-router', 'expo-secure-store', 'expo-apple-authentication', 'expo-haptics', 'expo-local-authentication']. Ensure scheme is 'vibecheck' for deep linking.\n\n3. .env.example — Add all required env vars with descriptions: EXPO_PUBLIC_API_URL (backend URL), EXPO_PUBLIC_REVENUECAT_KEY (RevenueCat iOS API key), OPENAI_API_KEY (for AI mood analysis), APPLE_BUNDLE_ID (iOS bundle ID).\n\n4. backend/Dockerfile — Verify the EXPOSE port matches the configured PORT env var (8080). Add HEALTHCHECK instruction: HEALTHCHECK --interval=30s --timeout=5s --retries=3 CMD wget -q --spider http://localhost:8080/api/health || exit 1.\n\n5. mobile/app.json — Add splash screen config: splash.backgroundColor '#ffffff', splash.resizeMode 'contain'. Ensure icon path points to existing assets/icon.png.\n\nThis task ensures the app is ready for EAS Build and App Store Connect submission.",
      "status": "pending",
      "priority": 6,
      "depends_on": [],
      "test_command": "cd mobile && npx tsc --noEmit",
      "auto_commit": true,
      "created_at": "",
      "updated_at": "2026-02-07T14:34:47Z",
      "error": "planning failed: engine: all 1 providers failed:\n  provider GLM-Planner (glm-4.7): failed after 2 retries: API returned 429: {\"error\":{\"code\":\"1302\",\"message\":\"Rate limit reached for requests\"}}"
    }
  ]
}